# St7SetFactorsEnvelopeData

Assigns the settings for the specified factors envelope for the currently open solution.

long St7SetFactorsEnvelopeData(long uID, long Envelope, long EnvType,
char* EnvName)
Input Parameters
uID
Strand7 model file ID.
Envelope
Factors envelope number.
EnvType
Factors envelope type; either etFactEnvelopeMin or etFactEnvelopeMax.
EnvName
Name of the envelope.